#Atividade 7 - Sintaxe básica: Operadores

#Exercício 1
print('\n', '-'*15, 'Exercício 1', '-'*15, '\n')

# Glicina 1 : ATOMO x y z
N_01 = (108.304, 100.827, 67.992)
CA_01 = (108.477, 100.389, 69.362)
C_01 = (109.907, 100.555, 69.817)
O_01 = (110.821, 100.799, 69.027)


# Glicina 2 : ATOMO x y z
N_02 = (107.670, 101.359, 70.074)
CA_02 = (108.477, 100.389, 69.362)
C_02 = (109.513, 101.011, 68.450)
O_02 = (110.667, 100.572, 68.425)

#RMSD (Root Mean Square Deviation)

soma1 = (N_01[0] - N_02[0])**2 + (N_01[1] - N_02[1])**2 + (N_01[2] - N_02[2])**2
soma2 = (CA_01[0] - CA_02[0])**2 + (CA_01[1] - CA_02[1])**2 + (CA_01[2] - CA_02[2])**2
soma3 = (C_01[0] - C_02[0])**2 + (C_01[1] - C_02[1])**2 + (C_01[2] - C_02[2])**2
soma4 = (O_01[0] - O_02[0])**2 + (O_01[1] - O_02[1])**2 + (O_01[2] - O_02[2])**2

print(soma1)
print(soma2)
print(soma3)
print(soma4)

print(soma1 + soma2 + soma3 + soma4)

# B. A. R. T. > < ( ( (º > Rm 11:36 < º ) ) ) > <